"use client";

import { Box, Typography } from "@mui/material";

export default function AboutPage() {
  return (
    <Box>
      <Typography variant="h4" gutterBottom>
        আমিন ডায়াগনস্টিক সম্পর্কে
      </Typography>
      <Typography paragraph sx={{ whiteSpace: "pre-line" }}>
        {`কম খরচে, সেরা সেবা\n\nআমিন ডায়াগনস্টিক এন্ড মেডিকেল সার্ভিসেস-এ আপনাকে স্বাগতম। কুষ্টিয়া ও ঝিনাইদহের অন্যতম বিশ্বস্ত ও  আধুনিক ডায়াগনস্টিক সেন্টার হিসেবে, আমরা সঠিক রোগ নির্ণয় ও নির্ভরযোগ্য স্বাস্থ্যসেবা প্রদানের অঙ্গীকার নিয়ে কাজ করে যাচ্ছি।\nআমাদের প্রতিষ্ঠানে রয়েছে আধুনিক প্রযুক্তি সম্পন্ন ল্যাব, অভিজ্ঞ বিশেষজ্ঞ চিকিৎসক এবং উন্নত স্বাস্থ্যসেবা, যা রোগ নির্ণয় ও চিকিৎসার ক্ষেত্রে সর্বোচ্চ নির্ভুলতা নিশ্চিত করে। আমরা বিশ্বাস করি, সঠিক পরীক্ষা মানেই সঠিক চিকিৎসার প্রথম ধাপ, তাই আমরা আপনাকে সর্বোত্তম সেবা দিতে প্রতিশ্রুতিবদ্ধ।\nবিশ্বস্ততা, গুণগত মান ও নির্ভুল রিপোর্ট— এটাই আমাদের অঙ্গীকার`}
      </Typography>
      <Typography variant="h5" gutterBottom sx={{ mt: 2 }}>
        আমিন ডায়াগনস্টিক এর ইতিবৃত্ত
      </Typography>
      <Typography paragraph sx={{ whiteSpace: "pre-line" }}>
        {`২০০৩ সালে আমিন ডায়াগনস্টিক তার যাত্রা শুরু করে বাংলাদেশের সাংস্কৃতিক রাজধানী কুষ্টিয়ার প্রাণকেন্দ্রে কোর্টপাড়ায়। 'কম খরচে, সেরা সেবা' সুনিশ্চিত করা এবং বৃহত্তর কুষ্টিয়ার মানুষের জন্য স্বাস্থ্যসেবা খাতের বৈপ্লবিক পরিবর্তনের লক্ষ্যে কিছু উদ্যমী মানুষ শুরু করে পরাজিত না হতে চাওয়া এক সংগ্রাম।\nবিশ্ববিখ্যাত ব্র্যান্ডের প্রযুক্তি, সেরা টেকনিশিয়ান এবং সকল বিভাগে বিশেষজ্ঞ চিকিৎসক নিয়ে বিগত ২২ বছর ধরে আমিন ডায়াগনস্টিক শীর্ষ পর্যায়ে থেকে স্বাস্থ্যসেবা দিয়ে যাচ্ছে।\nমানসম্মত ও উন্নতমানের স্বাস্থ্যসেবার উদ্দেশ্যে ঝিনাইদহের প্রাণকেন্দ্রে বনানীপাড়াতে দ্বিতীয় শাখা চালু হয় এবং ১ জানুয়ারি ২০২৫ থেকে কার্যক্রম শুরু করে।`}
      </Typography>
      <Typography variant="h5" gutterBottom sx={{ mt: 2 }}>
        আমাদের লক্ষ্য ও উদ্দেশ্য
      </Typography>
      <Typography paragraph sx={{ whiteSpace: "pre-line" }}>
        {`আমিন ডায়াগনস্টিক এর লক্ষ্য কম খরচে, সেরা স্বাস্থ্যসেবা সকল মানুষের দ্বারপ্রান্তে পৌঁছে দেওয়া। সময়ের সাথে তাল মিলিয়ে বিশ্বসেরা ও সর্বাধুনিক প্রযুক্তির মেশিনারিজের সমন্বয়ে উন্নতমানের আধুনিক সেবা প্রদান আমাদের প্রধান উদ্দেশ্য।`}
      </Typography>
      <Typography variant="h5" gutterBottom sx={{ mt: 2 }}>
        কেনো আমিন ডায়াগনস্টিক?
      </Typography>
      <Typography paragraph sx={{ whiteSpace: "pre-line" }}>
        {`আমিন ডায়াগস্টিক একটি বিশ্বস্ত নাম এবং আপনার স্বাস্থ্য আমাদের প্রথম অগ্রাধিকার।`}
      </Typography>
      <ul>
        <li>ওয়ান-স্টপ মানসম্মত ডায়াগনস্টিক সেবা</li>
        <li>স্বল্পমূল্য পরীক্ষা নিরীক্ষা</li>
        <li>বিশেষজ্ঞ ডাক্তার চেম্বার</li>
        <li>উন্নতমানের আধুনিক মেশিনারীজ</li>
        <li>অনলাইন রিপোর্ট ডেলিভারী</li>
        <li>হোম/অফিসে স্যাম্পল সংগ্রহ</li>
      </ul>
      <Typography variant="h5" gutterBottom sx={{ mt: 2 }}>
        যোগাযোগ করুন
      </Typography>
      <Typography paragraph sx={{ whiteSpace: "pre-line" }}>
        {`কুষ্টিয়া শাখা: ৩০/২০/সি, কলেজ রোড, কুষ্টিয়া\nঝিনাইদহ শাখা: ৪৪ (আলিয়া মাদ্রাসার বিপরীতে), ঝিনাইদহ\nহেল্পলাইন: ০১৭১২-২৪৩৫১৪ / ০১৯৭২-২৪৩৫১৪\nই-মেইল: aminhealth@gmail.com`}
      </Typography>
    </Box>
  );
}
